In [9]:
import pandas as pd
import numpy as np
d = {
    'A': [1,2, np.nan],
    'B':[5, np.nan, np.nan],
    'C':[1,2,3]
}
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [10]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [11]:
df.dropna(axis=0)

     A    B  C
0  1.0  5.0  1

In [12]:
df.dropna(axis = 1)

   C
0  1
1  2
2  3

In [13]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [14]:
df.fillna(value='Filling Value')

               A              B  C
0            1.0            5.0  1
1            2.0  Filling Value  2
2  Filling Value  Filling Value  3

In [15]:
df=pd.DataFrame(d)
a=df['A'].fillna(value=df['A'].mean())
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [16]:
a

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [17]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [18]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [19]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [20]:
df['A'].fillna(value=df['A'].mean(),inplace=True)
df

C:\Users\bheem\AppData\Local\Temp\ipykernel_2192\736070674.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['A'].fillna(value=df['A'].mean(),inplace=True)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  1.5  NaN  3

In [21]:
data = {
    'Company':['Google', 'Google', 'MSFT', 'FB','FB','IBM'],
    'Person': ['Sam','Nihad','Any','Van','Rakib','Ovi'],
    'Sales': [200, 120, 340, 124, 243, 350]
}
df=pd.DataFrame(data)
df

  Company Person  Sales
0  Google    Sam    200
1  Google  Nihad    120
2    MSFT    Any    340
3      FB    Van    124
4      FB  Rakib    243
5     IBM    Ovi    350

In [30]:
df

  Company Person  Sales
0  Google    Sam    200
1  Google  Nihad    120
2    MSFT    Any    340
3      FB    Van    124
4      FB  Rakib    243
5     IBM    Ovi    350

In [67]:
byComp=df.groupby('Company')
byComp.mean(numeric_only=True)

KeyError: 'Company'

In [29]:
byComp.sum()

           Person  Sales
Company
FB       VanRakib    367
Google   SamNihad    320
IBM           Ovi    350
MSFT          Any    340

In [61]:
byComp.std(numeric_only=True)

             Sales
Company
FB       84.145707
Google   56.568542
IBM            NaN
MSFT           NaN

In [33]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
Google        2      2
IBM           1      1
MSFT          1      1

In [34]:
df

  Company Person  Sales
0  Google    Sam    200
1  Google  Nihad    120
2    MSFT    Any    340
3      FB    Van    124
4      FB  Rakib    243
5     IBM    Ovi    350

In [35]:
df.groupby('Company').describe()

        Sales
        count   mean        std    min     25%    50%     75%    max
Company
FB        2.0  183.5  84.145707  124.0  153.75  183.5  213.25  243.0
Google    2.0  160.0  56.568542  120.0  140.00  160.0  180.00  200.0
IBM       1.0  350.0        NaN  350.0  350.00  350.0  350.00  350.0
MSFT      1.0  340.0        NaN  340.0  340.00  340.0  340.00  340.0

In [36]:
df1 = pd.DataFrame(np.random.randint(1, 20, size = (4, 3)), [1,2,3,4], ['W', 'X', 'Y'])
df2 = pd.DataFrame(np.random.randint(20,40, size = (4, 3)), [5,6,7,8], ['W', 'X', 'Y'])
df3 = pd.DataFrame(np.random.randint(40,60, size = (4, 3)), [9,10,11,12], ['W', 'X', 'Y'])
df1

    W   X   Y
1   1   9   5
2   5   3  12
3  12  12  10
4   4  11  14

In [37]:
df2

    W   X   Y
5  20  24  29
6  21  23  34
7  38  36  28
8  22  24  30

In [38]:
df3

     W   X   Y
9   49  54  48
10  45  57  44
11  54  41  41
12  46  47  59

In [39]:
frame=[df1,df2,df3]
pd.concat(frame)

     W   X   Y
1    1   9   5
2    5   3  12
3   12  12  10
4    4  11  14
5   20  24  29
6   21  23  34
7   38  36  28
8   22  24  30
9   49  54  48
10  45  57  44
11  54  41  41
12  46  47  59

In [40]:
pd.concat(frame,axis=1)

       W     X     Y     W     X     Y     W     X     Y
1    1.0   9.0   5.0   NaN   NaN   NaN   NaN   NaN   NaN
2    5.0   3.0  12.0   NaN   NaN   NaN   NaN   NaN   NaN
3   12.0  12.0  10.0   NaN   NaN   NaN   NaN   NaN   NaN
4    4.0  11.0  14.0   NaN   NaN   NaN   NaN   NaN   NaN
5    NaN   NaN   NaN  20.0  24.0  29.0   NaN   NaN   NaN
6    NaN   NaN   NaN  21.0  23.0  34.0   NaN   NaN   NaN
7    NaN   NaN   NaN  38.0  36.0  28.0   NaN   NaN   NaN
8    NaN   NaN   NaN  22.0  24.0  30.0   NaN   NaN   NaN
9    NaN   NaN   NaN   NaN   NaN   NaN  49.0  54.0  48.0
10   NaN   NaN   NaN   NaN   NaN   NaN  45.0  57.0  44.0
11   NaN   NaN   NaN   NaN   NaN   NaN  54.0  41.0  41.0
12   NaN   NaN   NaN   NaN   NaN   NaN  46.0  47.0  59.0

In [41]:
left = {
    'key':['k0','k1','k2','k3'],
    'A':[10,20,30,40],
    'B':[1,2,3,4]
}
right = {
    'key':['k0','k1','k2','k3'],
    'C':[100,200,300,400],
    'D':[11,12,13,14]
}
left = pd.DataFrame(left)
right = pd.DataFrame(right)
left

  key   A  B
0  k0  10  1
1  k1  20  2
2  k2  30  3
3  k3  40  4

In [42]:
right

  key    C   D
0  k0  100  11
1  k1  200  12
2  k2  300  13
3  k3  400  14

In [43]:
pd.merge(left,right,on='key')

  key   A  B    C   D
0  k0  10  1  100  11
1  k1  20  2  200  12
2  k2  30  3  300  13
3  k3  40  4  400  14

In [44]:
left = {
    'A':['A0','A1','A2'],
    'B':['B0','B1','B2']
}
right = {
    'C':['C0','C2','C3'],
    'D':['D0','D2','D3']
}
left = pd.DataFrame(left, index = ['k0','k1','k2'])
right = pd.DataFrame(right, index = ['k0','k2','k3'])
left

     A   B
k0  A0  B0
k1  A1  B1
k2  A2  B2

In [45]:
right

     C   D
k0  C0  D0
k2  C2  D2
k3  C3  D3

In [46]:
left.join(right, how = 'inner')

     A   B   C   D
k0  A0  B0  C0  D0
k2  A2  B2  C2  D2

In [47]:
df = pd.DataFrame({
    'col1':[444,555,666,444],
    'col2':[1,2,3,4],
    'col3':['abc','def','ghi','xyz']
})
df

   col1  col2 col3
0   444     1  abc
1   555     2  def
2   666     3  ghi
3   444     4  xyz

In [48]:
df['col1'].unique()

array([444, 555, 666])

In [49]:
df['col1'].nunique()

3

In [50]:
df['col1'].value_counts()

col1
444    2
555    1
666    1
Name: count, dtype: int64

In [51]:
def times2(x):
    return 2*x
df['col2'].apply(times2)

0    2
1    4
2    6
3    8
Name: col2, dtype: int64

In [52]:
df['col2'].apply(lambda x: x**2)

0     1
1     4
2     9
3    16
Name: col2, dtype: int64

In [82]:
df=pd.read_excel('SampleData.xlsx', sheet_name = 'SalesOrders')
df

FileNotFoundError: [Errno 2] No such file or directory: 'SampleData.xlsx'

In [55]:
df.head(10)

   col1  col2 col3
0   444     1  abc
1   555     2  def
2   666     3  ghi
3   444     4  xyz

In [56]:
df.tail()

   col1  col2 col3
0   444     1  abc
1   555     2  def
2   666     3  ghi
3   444     4  xyz

In [57]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [58]:
df.columns.to_list()

['col1', 'col2', 'col3']

In [59]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes

In [69]:
df.nunique()

col1    3
col2    4
col3    4
dtype: int64

In [70]:
df.head()

   col1  col2 col3
0   444     1  abc
1   555     2  def
2   666     3  ghi
3   444     4  xyz

In [73]:
df['20% Dis'] = df['Total'].apply(lambda x: x*(20/100))
df.head()

KeyError: 'Total'

In [81]:
df['Payment'] = df['Total'] - df['20% Dis']
df.head()

KeyError: 'Total'